[
  {
    "author": "Cynthia Benson",
    "date": "45 weeks ago",
    "rating": 5,
    "text": "Did a great job on the various repairs at our house. Ricky and all crew responsive to our needs and all of our...",
    "owner_reply": "Thank you so much! It was a pleasure working for you."
  },
  {
    "author": "Sampson0814",
    "date": "Sep 16, 2024",
    "rating": 5,
    "text": "This place is top notch! If you’re looking for someone who takes pride in their work you’ve found the right place!",
    "owner_reply": "Much appreciated! We look forward to continuing working with you."
  },
  {
    "author": "John White",
    "date": "Jun 14, 2024",
    "rating": 5,
    "text": "I have heard nothing but good things from them serving our Timberwood community",
    "owner_reply": "John, thank you so much for the kind review. Also, we have heard only great things about you and White Fox.!!"
  },
  {
    "author": "Debbie Stevens",
    "date": "Jul 20, 2023",
    "rating": 5,
    "text": "Wow all I can say is wow ricky cj and crew fixed my outside to stop water from coming in the damage to my floors are...",
    "owner_reply": "Debbie, it has truly been a pleasure working for you. We look forward to continue this great relationship. Thank you for the kind review."
  },
  {
    "author": "scottie wise",
    "date": "Dec 13, 2022",
    "rating": 5,
    "text": "The best experience I've had in a long time with home repair very professional very good",
    "owner_reply": "Thank you for your kinds words, Scott. It was a pleasure working for you. Please give us a call if there is anything else you need."
  },
  {
    "author": "Keith F",
    "date": "May 12, 2022",
    "rating": 5,
    "text": "",
    "owner_reply": "Thank you Keith for the positive review! We look forward to working with you again soon."
  },
  {
    "author": "Ryan Lindahl",
    "date": "Mar 4, 2022",
    "rating": 5,
    "text": "Excellent crew! Awesome work done in my kitchen. Time efficient and very trustworthy! Will use them again and recommend these guys to anyone!",
    "owner_reply": "Ryan, thank you for the great review. You were a great client to work with! Very reasonable and responsive. We hope to work with you again."
  },
  {
    "author": "Rikki",
    "date": "Mar 3, 2022",
    "rating": 5,
    "text": "I would definitely recommend hiring Ricky and his team for repairs! They are friendly and responsive and provide a...",
    "owner_reply": "Thanks Rikki for the kind review! We look forward to working again with you."
  },
  {
    "author": "Loyalty Cook",
    "date": "Mar 3, 2022",
    "rating": 5,
    "text": "",
    "owner_reply": ""
  },
  {
    "author": "Amanda McKinney",
    "date": "Feb 11, 2022",
    "rating": 5,
    "text": "",
    "owner_reply": ""
  },
  {
    "author": "Reuben Jacob",
    "date": "Jan 11, 2022",
    "rating": 5,
    "text": "These guys are extremely experienced and were very helpful! They did so much work very quickly and I would recommend them to anyone who is looking for any kind of repairs to their home. They do it all!",
    "owner_reply": "Reuben! Thank you for your kind words. We look forward to working with you again soon."
  },
  {
    "author": "Tony Linog",
    "date": "Jan 7, 2022",
    "rating": 5,
    "text": "",
    "owner_reply": ""
  },
  {
    "author": "Kala Guido",
    "date": "Jan 7, 2022",
    "rating": 5,
    "text": "Nothin’ to it crew does great work with an awesome attitude.",
    "owner_reply": "Thats very kind of you, Kala. Looking forward to working with you again soon!"
  },
  {
    "author": "Zach Wood",
    "date": "Jan 7, 2022",
    "rating": 5,
    "text": "",
    "owner_reply": ""
  },
  {
    "author": "Joseph Ray",
    "date": "Jan 7, 2022",
    "rating": 5,
    "text": "Always ready to help. Definitely did it better than I could. Who needs Youtube when you have these guys?",
    "owner_reply": "Thanks, Joe! Your review means a lot to us. Look forward to seeing you again soon!"
  },
  {
    "author": "Karen Hickman",
    "date": "Jan 7, 2022",
    "rating": 5,
    "text": "A great Christian based company... Very particular in doing their job well.",
    "owner_reply": "Thank you, Karen. We look forward to continuing to work with you."
  },
  {
    "author": "Wyatt Winburn",
    "date": "Jan 7, 2022",
    "rating": 5,
    "text": "Does great work, cleans job site well, and is very polite!",
    "owner_reply": "Glad everything was done to your expectations. Thanks for the review."
  }
]
